//practice problem ans:১
/* v8 engine টা  জাভাস্কিপট কোডটাকে প্রথমে ব্রেকডাউন করে  AST করে নেয় । তারপর কোডটিকে মেসিন ল্যাংগুয়েজে  কভার্টকরে । আমরা যেভাবে কোড লিখি সেটা হলো হাই লেভেল  প্রোগামিং ল্যাগুয়েজ  যেটা  মেশিন বুজতে পারে ।   আমরা যে কোডটা লিখি তাকে সোরস কোড বলে ।  এই কোডটা    SOURCE CODE MACHINE CODE  CONVERT  HOYE .  মানে  লাইন বাই লাইন  কোড্িট  INTERPRET তারপর িএকসাথে আউটপুট দিবে
 */
//practice problem ans:২
/* ব্র্রাউজারের ভিতর একটা সফট্ওয়্যার আছে  যাকে javascript engine বলে ।  এই ইজ্ঞিনটা মূলত কোড পরে বুঝে এবং রান করায়   */
//practice problem ans:৩
/* jit  ---just in time     compiler  হলো একটা মেকানিজম  যেটা সোর্স কোড কে মেসিন  কোডে রুপান্তর করে  । আমরা যে কোডটা লিখি তা হলো সোর্স কোডটা লাইন বাই লাইন  interpreted  হয় তবে এই প্রসেসটা ্ একটু  স্লো  তবে এখন  just in time     compiler   ব্যাবহার করে   কোড আরও দ্রুত রান  করতে পারে  এই ইঞ্জিন ।*/